bench/results/java21/20260425T073259Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 6646.89, "p50": "3.45ms", "p95": "5.86ms", "p99": "6.80ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.60ms    1.03ms  19.27ms   72.62%\n    Req/Sec     1.67k   137.86     1.90k    77.04%\n  Latency Distribution\n     50%    3.45ms\n     75%    4.14ms\n     90%    4.92ms\n     99%    6.80ms\n  797965 requests in 2.00m, 181.88MB read\nRequests/sec:   6646.89\nTransfer/sec:      1.52MB"}